<a href="https://colab.research.google.com/github/italomarcelogit/python.free/blob/master/Pandas_Useful_Commands.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# **Pandas - Series and DataFrame**

In [118]:
# Series
mySerie1 = pd.Series([1,2,3,4,5,])
mySerie2 = pd.Series(list('abcde'))

In [119]:
mySerie1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [120]:
mySerie1.index, mySerie1.values

(RangeIndex(start=0, stop=5, step=1), array([1, 2, 3, 4, 5]))

In [121]:
mySerie2

0    a
1    b
2    c
3    d
4    e
dtype: object

In [122]:
mySerie2.index, mySerie2.values

(RangeIndex(start=0, stop=5, step=1),
 array(['a', 'b', 'c', 'd', 'e'], dtype=object))

In [ ]:
# DataFrames
names = ['Joao', 'Pedro', 'Carla']
ages = [20, 22, 15]
sex = ['Male', None, 'Female']
myDf = pd.DataFrame(data={'Names': names, 'Ages': ages, 'Sex': sex})

# or 

myDf2 = pd.DataFrame(columns=['Names', 'Ages'])
myDf2['Names'] = names
myDf2['Ages'] = ages

In [ ]:
myDf

   Names  Ages     Sex
0   Joao    20    Male
1  Pedro    22    None
2  Carla    15  Female

In [ ]:
myDf2

   Names  Ages
0   Joao    20
1  Pedro    22
2  Carla    15

# **ReadCSV or XLS**

Creating Serie or DataFrame using csv File

In [ ]:
path = 'https://raw.githubusercontent.com/italomarcelogit/python.free/master/fbprophet/pdv.csv'
df = pd.read_csv(path)
df.head(3)

   id        data  loja  cidade  produto   valor  desconto      total  vendedor
0   1  2017-01-24     2       2        8  106015         1  104954.85         6
1   2  2017-01-10     0       1        9  117439         4  112741.44         8
2   3  2017-01-08     4       2        0   72602         1   71875.98         5

In [ ]:
desconto = pd.read_csv(path, usecols=['desconto'])
desconto.head()

   desconto
0         1
1         4
2         1
3         2
4         5

In [ ]:
pd.read_csv(path, nrows=3, usecols=['loja', 'cidade'])

   loja  cidade
0     2       2
1     0       1
2     4       2

In [ ]:
# Excel

xls = 'https://github.com/italomarcelogit/python.free/blob/master/dataset-sales-random/cities-BR.xlsx?raw=true'

df = pd.read_excel(xls)

In [ ]:
df.head(3)

             city      city_ascii      lat  ...  capital  population          id
0       São Paulo       Sao Paulo -23.5587  ...    admin  18845000.0  1076532519
1  Rio de Janeiro  Rio de Janeiro -22.9250  ...    admin  11748000.0  1076887657
2  Belo Horizonte  Belo Horizonte -19.9150  ...    admin   5575000.0  1076967355

[3 rows x 11 columns]

In [ ]:
pd.read_excel(xls, nrows=3)

             city      city_ascii      lat  ...  capital  population          id
0       São Paulo       Sao Paulo -23.5587  ...    admin  18845000.0  1076532519
1  Rio de Janeiro  Rio de Janeiro -22.9250  ...    admin  11748000.0  1076887657
2  Belo Horizonte  Belo Horizonte -19.9150  ...    admin   5575000.0  1076967355

[3 rows x 11 columns]

# **Get DataFrame/Serie info**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 387 entries, 0 to 386
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        387 non-null    object
 1   city_ascii  387 non-null    object
 2   lat         387 non-null    float64
 3   lng         387 non-null    float64
 4   country     387 non-null    object
 5   iso2        387 non-null    object
 6   iso3        387 non-null    object
 7   admin_name  387 non-null    object
 8   capital     27 non-null     object
 9   population  387 non-null    float64
 10  id          387 non-null    int64
dtypes: float64(3), int64(1), object(7)
memory usage: 33.4+ KB

In [ ]:
df.describe()

              lat         lng    population            id
count  387.000000  387.000000  3.870000e+02  3.870000e+02
mean   -15.552564  -47.713768  3.288352e+05  1.076483e+09
std      8.986011    7.182142  1.260428e+06  2.952965e+05
min    -33.520000  -72.670000  9.560000e+02  1.076000e+09
25%    -22.684800  -51.298300  3.888450e+04  1.076229e+09
50%    -16.650000  -47.860000  6.805600e+04  1.076495e+09
75%     -7.145550  -42.530000  1.877530e+05  1.076736e+09
max      3.216700  -34.850000  1.884500e+07  1.076998e+09

In [123]:
df.describe(include=['object'])

         city city_ascii country iso2 iso3 admin_name capital
count     387        387     387  387  387        387      27
unique    383        383       1    1    1         27       2
top     Natal      Crato  Brazil   BR  BRA  São Paulo   admin
freq        2          2     387  387  387         47      26

In [124]:
df.shape

(387, 11)

In [125]:
df.index

RangeIndex(start=0, stop=387, step=1)

In [126]:
df.columns

Index(['city', 'city_ascii', 'lat', 'lng', 'country', 'iso2', 'iso3',
       'admin_name', 'capital', 'population', 'id'],
      dtype='object')

In [127]:
df.select_dtypes(include=['float64', 'int64']).head(2)

       lat     lng  population          id
0 -23.5587 -46.625  18845000.0  1076532519
1 -22.9250 -43.225  11748000.0  1076887657

In [128]:
df.select_dtypes(include=[np.number]).head(2)

       lat     lng  population          id
0 -23.5587 -46.625  18845000.0  1076532519
1 -22.9250 -43.225  11748000.0  1076887657

In [129]:
df.select_dtypes(include=['object']).head(2)

             city      city_ascii country iso2 iso3      admin_name capital
0       São Paulo       Sao Paulo  Brazil   BR  BRA       São Paulo   admin
1  Rio de Janeiro  Rio de Janeiro  Brazil   BR  BRA  Rio de Janeiro   admin

**Copy**

In [ ]:
df1 = pd.DataFrame({'a':np.zeros(5), 'b':np.arange(1,6), 'c': np.array(5)})
df1

     a  b  c
0  0.0  1  5
1  0.0  2  5
2  0.0  3  5
3  0.0  4  5
4  0.0  5  5

In [ ]:
df2 = df1
df2

     a  b  c
0  0.0  1  5
1  0.0  2  5
2  0.0  3  5
3  0.0  4  5
4  0.0  5  5

In [130]:
df2['a'] = np.array(3)
df2['a'].values, df1['a'].values

(array([3, 3, 3, 3, 3]), array([3, 3, 3, 3, 3]))

In [137]:
df1 = pd.DataFrame({'a':np.zeros(5), 'b':np.arange(1,6), 'c': np.array(5)})
df2 = df1.copy()
df2['a'] = np.array(3)
df2['a'].values, df1['a'].values

(array([3, 3, 3, 3, 3]), array([0., 0., 0., 0., 0.]))

**CREATING NEW COLUMN OR ROW**

In [138]:
df2

   a  b  c
0  3  1  5
1  3  2  5
2  3  3  5
3  3  4  5
4  3  5  5

In [139]:
# add column d
df2['d'] = np.random.randint(100,150.5)
df2

   a  b  c    d
0  3  1  5  125
1  3  2  5  125
2  3  3  5  125
3  3  4  5  125
4  3  5  5  125

In [141]:
# add row with index 5
df2 = df2.append({'a': 301, 'b': 304, 'c': 303, 'd': 304}, ignore_index=True)
df2

     a    b    c    d
0    3    1    5  125
1    3    2    5  125
2    3    3    5  125
3    3    4    5  125
4    3    5    5  125
5  301  304  303  304

**MODIFY COLUMN OR ROW**

In [142]:
# MODIFY COLUMN
df2['d'] = np.array(333)
df2

     a    b    c    d
0    3    1    5  333
1    3    2    5  333
2    3    3    5  333
3    3    4    5  333
4    3    5    5  333
5  301  304  303  333

In [145]:
# MODIFY ROW
df2.iloc[5] = [444, 444,444,444]
df2

     a    b    c    d
0    3    1    5  333
1    3    2    5  333
2    3    3    5  333
3    3    4    5  333
4    3    5    5  333
5  444  444  444  444

**DELETE COLUMN OR ROW**

In [147]:
# DELETE COLUMN d
df2 = df2.drop('d', axis=1)
df2

     a    b    c
0    3    1    5
1    3    2    5
2    3    3    5
3    3    4    5
4    3    5    5
5  444  444  444

In [148]:
# DELETE ROW 5, by index

df2 = df2.drop([5])
df2

   a  b  c
0  3  1  5
1  3  2  5
2  3  3  5
3  3  4  5
4  3  5  5

**PANDAS MATH**

In [150]:
df2

   a  b  c
0  3  1  5
1  3  2  5
2  3  3  5
3  3  4  5
4  3  5  5

In [151]:
df2.sum()

a    15
b    15
c    25
dtype: int64

In [153]:
df2['a'].sum()

15

In [154]:
df2['b'].min()

1

In [157]:
df2['b'].max()

5

In [155]:
df2.mean()

a    3.0
b    3.0
c    5.0
dtype: float64

In [156]:
df2['b'].median()

3.0

**map**

In [ ]:
df3 = pd.DataFrame([{'name': 'Joao', 'status':1}, {'name':'pedro', 'status': 0}])
df3

    name  status
0   Joao       1
1  pedro       0

In [ ]:
status = {1:'passed', 0:'dont passed'}
df3['textStatus'] = df3['status'].map(status)
df3

    name  status   textStatus
0   Joao       1       passed
1  pedro       0  dont passed

**Apply (lambda function)**

In [ ]:
df3 = pd.DataFrame([
                    {'name': 'Joao', 'h':1.72, 'w': 85}, 
                    {'name':'pedro', 'h':1.70, 'w': 65}
                    ])
df3

    name     h   w
0   Joao  1.72  85
1  pedro  1.70  65

In [ ]:
def imcBMI(h, w):
  return w/h**2

df3['imc'] = df3.apply(lambda x: imcBMI(x['h'], x['w']), axis=1)
df3

    name     h   w        imc
0   Joao  1.72  85  28.731747
1  pedro  1.70  65  22.491349

**VALUE COUNTS (frequency)**

In [ ]:
x = np.random.randint(1, 4, 50)
x

array([3, 1, 2, 2, 3, 3, 1, 1, 2, 3, 3, 2, 3, 3, 3, 2, 2, 3, 2, 3, 1, 2,
       3, 2, 3, 2, 2, 2, 1, 2, 2, 3, 1, 1, 1, 2, 3, 1, 1, 1, 3, 3, 3, 2,
       2, 1, 1, 1, 1, 2])

In [ ]:
pd.value_counts(x)

2    18
3    17
1    15
dtype: int64

In [ ]:
df4 = pd.DataFrame({'x': x})
df4['x'].value_counts()

2    18
3    17
1    15
Name: x, dtype: int64

In [ ]:
df4['x'].describe()

count    50.000000
mean      2.040000
std       0.807111
min       1.000000
25%       1.000000
50%       2.000000
75%       3.000000
max       3.000000
Name: x, dtype: float64

**Missing Values**

In [184]:
names = ['A', 'B', 'C']
ages = [20, np.nan, 15]
sex = [np.nan, np.nan, 'Female']
df5 = pd.DataFrame({'name': names, 'age': ages, 'sex':sex})
df5

  name   age     sex
0    A  20.0     NaN
1    B   NaN     NaN
2    C  15.0  Female

In [185]:
df5.isnull()

    name    age    sex
0  False  False   True
1  False   True   True
2  False  False  False

In [186]:
df5.isnull().sum()

name    0
age     1
sex     2
dtype: int64

In [187]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     2 non-null      float64
 2   sex     1 non-null      object
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

**Fill Missing Values**

In [188]:
df5

  name   age     sex
0    A  20.0     NaN
1    B   NaN     NaN
2    C  15.0  Female

In [189]:
# AGE ==> assuming the rule is: for null values, enter the MAX value

df5.age = df5.age.fillna(df5.age.max())
df5

  name   age     sex
0    A  20.0     NaN
1    B  20.0     NaN
2    C  15.0  Female

In [190]:
# SEX ==> assuming the rule is: for null values, enter the UNKNOW value

df5.sex = df5.sex.fillna('Unknow')
df5

  name   age     sex
0    A  20.0  Unknow
1    B  20.0  Unknow
2    C  15.0  Female

**filtering dataframe**

In [191]:
# filtering data with sex == Unknow
df5[df5.sex == 'Unknow']

  name   age     sex
0    A  20.0  Unknow
1    B  20.0  Unknow

In [192]:
# or
df5.query('sex == "Unknow"')

  name   age     sex
0    A  20.0  Unknow
1    B  20.0  Unknow

**Selecting values**

![image.png]()

In [193]:
df5.iloc[1]

name         B
age         20
sex     Unknow
Name: 1, dtype: object

In [194]:
# or 
df5.iloc[1].values.tolist()

['B', 20.0, 'Unknow']

In [195]:
# or return only age value from row 1
df5.age.iloc[1]

20.0

In [198]:
# update sex columns, 'Unknow' to 'Not Informed' values
df5

  name   age     sex
0    A  20.0  Unknow
1    B  20.0  Unknow
2    C  15.0  Female

In [206]:
df5.sex = df5.sex.apply(lambda x: 'Not Informed' if str(x) == "Unknow" else x)
df5

  name   age           sex
0    A  20.0  Not Informed
1    B  20.0  Not Informed
2    C  15.0        Female

**Basic Function Example to EDA on dataframe**

In [207]:
df

                                 city  ...          id
0                           São Paulo  ...  1076532519
1                      Rio de Janeiro  ...  1076887657
2                      Belo Horizonte  ...  1076967355
3                        Porto Alegre  ...  1076658221
4                            Brasília  ...  1076144436
..                                ...  ...         ...
382                          Xinguara  ...  1076290442
383                             Amapá  ...  1076834242
384                             Abunã  ...  1076632448
385  Vila Bela da Santíssima Trindade  ...  1076493823
386                 Príncipe da Beira  ...  1076482734

[387 rows x 11 columns]

In [208]:
def eda(dfA, all=False, desc='Exploratory Data Analysis'):
    print(desc)
    print(f'\nShape:\n{dfA.shape}')
    print(f'\nDTypes - Numerics')
    print(dfA.select_dtypes(include=np.number).columns.tolist())
    print(f'\nDTypes - Categoricals')
    print(dfA.select_dtypes(include='object').columns.tolist())
    print(f'\nIs Null: {dfA.isnull().sum().sum()}')
    print(f'{dfA.isnull().mean().sort_values(ascending=False)}')
    dup = dfA.duplicated()
    print(f'\nDuplicated: \n{dfA[dup].shape}\n')
    try:
        print(dfA[dfA.duplicated(keep=False)].sample(4))
    except:
        pass
    if all:  # here you put yours prefered analysis that detail more your dataset
        
        print(f'\nDTypes - Numerics')
        print(dfA.describe(include=[np.number]))
        print(f'\nDTypes - Categoricals')
        print(dfA.describe(include=['object']))

# function Fill NaN values
def cleanNaN(dfA):
  for col in dfA:
    if type(dfA[col]) == 'object':
        dfA[col] = dfA[col].fillna('unknow')
    else:
        dfA[col] = dfA[col].fillna(0)
  return dfA

In [209]:
eda(df)

Exploratory Data Analysis

Shape:
(387, 11)

DTypes - Numerics
['lat', 'lng', 'population', 'id']

DTypes - Categoricals
['city', 'city_ascii', 'country', 'iso2', 'iso3', 'admin_name', 'capital']

Is Null: 360
capital       0.930233
id            0.000000
population    0.000000
admin_name    0.000000
iso3          0.000000
iso2          0.000000
country       0.000000
lng           0.000000
lat           0.000000
city_ascii    0.000000
city          0.000000
dtype: float64

Duplicated:
(0, 11)

In [210]:
eda(df, all=True)

Exploratory Data Analysis

Shape:
(387, 11)

DTypes - Numerics
['lat', 'lng', 'population', 'id']

DTypes - Categoricals
['city', 'city_ascii', 'country', 'iso2', 'iso3', 'admin_name', 'capital']

Is Null: 360
capital       0.930233
id            0.000000
population    0.000000
admin_name    0.000000
iso3          0.000000
iso2          0.000000
country       0.000000
lng           0.000000
lat           0.000000
city_ascii    0.000000
city          0.000000
dtype: float64

Duplicated:
(0, 11)


DTypes - Numerics
              lat         lng    population            id
count  387.000000  387.000000  3.870000e+02  3.870000e+02
mean   -15.552564  -47.713768  3.288352e+05  1.076483e+09
std      8.986011    7.182142  1.260428e+06  2.952965e+05
min    -33.520000  -72.670000  9.560000e+02  1.076000e+09
25%    -22.684800  -51.298300  3.888450e+04  1.076229e+09
50%    -16.650000  -47.860000  6.805600e+04  1.076495e+09
75%     -7.145550  -42.530000  1.877530e+05  1.076736e+09
max      3.216700  -34.850000  1.884500e+07  1.076998e+09

DTypes - Categoricals
         city city_ascii country iso2 iso3 admin_name capital
count     387        387     387  387  387        387      27
unique    383        383       1    1    1         27       2
top     Natal      Crato  Brazil   BR  BRA  São Paulo   admin
freq        2          2     387  387  387         47      26